# Laboratorium  nr 2

In [10]:
import pandas as pd
data_imported = pd.read_csv('../OriginalData/drinks.csv')

In [35]:
data_imported.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [6]:
alc_measured = pd.DataFrame(data_imported)

In [41]:
abstinent_df = pd.DataFrame(alc_measured.loc[(alc_measured['spirit_servings'] == 0) & (alc_measured['wine_servings'] == 0) & 
                 (alc_measured['beer_servings'] == 0) & (alc_measured['total_litres_of_pure_alcohol'] == 0)])
abstinent_df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
13,Bangladesh,0,0,0,0.0
46,North Korea,0,0,0,0.0
79,Iran,0,0,0,0.0
90,Kuwait,0,0,0,0.0

In [46]:
abstinent_df.iloc[0]
# do tablicy zapisać indeksy, które mają zostać usunięte z danych oryginalnych, żeby dane 
# oryginalne przedstawiały SPOŻYCIE alko
# usunąć dane 
# dodać do folderów rzeczy

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol            0.0
Name: 0, dtype: object

In [40]:
abstinent_df.reset_index()

,index,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,Afghanistan,0,0,0,0.0
1,13,Bangladesh,0,0,0,0.0
2,46,North Korea,0,0,0,0.0
3,79,Iran,0,0,0,0.0
4,90,Kuwait,0,0,0,0.0
5,97,Libya,0,0,0,0.0
6,103,Maldives,0,0,0,0.0
7,106,Marshall Islands,0,0,0,0.0
8,107,Mauritania,0,0,0,0.0
9,111,Monaco,0,0,0,0.0
10,128,Pakistan,0,0,0,0.0
11,147,San Marino,0,0,0,0.0
12,158,Somalia,0,0,0,0.0